1) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Exception/WhoopsRunner.php:27    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         $whoops = self::getWhoopsInstance($format);
         // Output is managed by the middleware pipeline
         $whoops->allowQuit(false);
-        ob_start();
+        
         $whoops->{$method}($error);
         $content = ob_get_clean();
         /** @var string|array<string> $contentType */

2) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Exception/WhoopsRunner.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // Output is managed by the middleware pipeline
         $whoops->allowQuit(false);
         ob_start();
-        $whoops->{$method}($error);
+        
         $content = ob_get_clean();
         /** @var string|array<string> $contentType */
         $contentType = $format->getPreferredContentType();

3) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Exception/WhoopsRunner.php:35    [M] Ternary

--- Original
+++ New
@@ @@
         $content = ob_get_clean();
         /** @var string|array<string> $contentType */
         $contentType = $format->getPreferredContentType();
-        return Factory::createResponse(500)->withBody(Factory::createStream($content ?: ''))->withHeader('Content-Type', $contentType);
+        return Factory::createResponse(500)->withBody(Factory::createStream($content ? '' : $content))->withHeader('Content-Type', $contentType);
     }
     private static function getWhoopsInstance(Format $format) : Run
     {

4) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Exception/WhoopsRunner.php:42    [M] Coalesce

--- Original
+++ New
@@ @@
     private static function getWhoopsInstance(Format $format) : Run
     {
         $whoops = new Run();
-        if (Application::NAME === ($_SERVER['X-Application'] ?? '')) {
+        if (Application::NAME === ('' ?? $_SERVER['X-Application'])) {
             $handler = new PrettyPageHandler();
             $handler->handleUnconditionally(true);
             $whoops->pushHandler($handler);

5) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Exception/WhoopsRunner.php:42    [M] Identical

--- Original
+++ New
@@ @@
     private static function getWhoopsInstance(Format $format) : Run
     {
         $whoops = new Run();
-        if (Application::NAME === ($_SERVER['X-Application'] ?? '')) {
+        if (Application::NAME !== ($_SERVER['X-Application'] ?? '')) {
             $handler = new PrettyPageHandler();
             $handler->handleUnconditionally(true);
             $whoops->pushHandler($handler);

6) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Exception/WhoopsRunner.php:44    [M] TrueValue

--- Original
+++ New
@@ @@
         $whoops = new Run();
         if (Application::NAME === ($_SERVER['X-Application'] ?? '')) {
             $handler = new PrettyPageHandler();
-            $handler->handleUnconditionally(true);
+            $handler->handleUnconditionally(false);
             $whoops->pushHandler($handler);
             return $whoops;
         }

7) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Exception/WhoopsRunner.php:44    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $whoops = new Run();
         if (Application::NAME === ($_SERVER['X-Application'] ?? '')) {
             $handler = new PrettyPageHandler();
-            $handler->handleUnconditionally(true);
+            
             $whoops->pushHandler($handler);
             return $whoops;
         }

8) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Exception/WhoopsRunner.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (Application::NAME === ($_SERVER['X-Application'] ?? '')) {
             $handler = new PrettyPageHandler();
             $handler->handleUnconditionally(true);
-            $whoops->pushHandler($handler);
+            
             return $whoops;
         }
         $whoops->pushHandler($format->getHandler());

9) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Exception/WhoopsRunner.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $whoops->pushHandler($handler);
             return $whoops;
         }
-        $whoops->pushHandler($format->getHandler());
+        
         return $whoops;
     }
 }

10) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Middleware/ErrorMiddleware.php:20    [M] TrueValue

--- Original
+++ New
@@ @@
 use function class_exists;
 class ErrorMiddleware implements MiddlewareInterface
 {
-    public function __construct(private bool $debug = true)
+    public function __construct(private bool $debug = false)
     {
     }
     public function process(ServerRequestInterface $request, RequestHandlerInterface $handler) : ResponseInterface

11) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Middleware/ErrorMiddleware.php:35    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     private function getErrorResponse(Throwable $exception, ServerRequestInterface $request) : ResponseInterface
     {
-        if ($this->debug && class_exists(WhoopsRunner::class)) {
+        if ($this->debug || class_exists(WhoopsRunner::class)) {
             $whoops = new WhoopsRunner();
             return $whoops::handle($exception, $request);
         }

12) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Middleware/MiddlewarePipeline.php:34    [M] CloneRemoval

--- Original
+++ New
@@ @@
     public function handle(ServerRequestInterface $request) : ResponseInterface
     {
         $middleware = $this->middlewareQueue->dequeue();
-        $next = clone $this;
+        $next = $this;
         return $middleware->process($request, $next);
     }
     public function process(ServerRequestInterface $request, RequestHandlerInterface $handler) : ResponseInterface


Timed Out mutants:
==================

5) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:30    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function run() : int
     {
-        if (PHP_SAPI === 'cli') {
+        if (PHP_SAPI !== 'cli') {
             return $this->runAsync($this->application);
         }
         return $this->runSync($this->application);

6) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $_SERVER['X-Application'] = 'antidot-react-http';
             return async(static fn(): ResponseInterface => $application->handle($request));
         });
-        $http->on('error', function (Throwable $e) : void {
-            if (true === $this->debug) {
-                dump($e);
-                return;
-            }
-            var_export($e);
-        });
+        
         $socket = new SocketServer('0.0.0.0:3000');
         $http->listen($socket);
         return 0;

7) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:48    [M] TrueValue

--- Original
+++ New
@@ @@
             return async(static fn(): ResponseInterface => $application->handle($request));
         });
         $http->on('error', function (Throwable $e) : void {
-            if (true === $this->debug) {
+            if (false === $this->debug) {
                 dump($e);
                 return;
             }

8) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:48    [M] Identical

--- Original
+++ New
@@ @@
             return async(static fn(): ResponseInterface => $application->handle($request));
         });
         $http->on('error', function (Throwable $e) : void {
-            if (true === $this->debug) {
+            if (true !== $this->debug) {
                 dump($e);
                 return;
             }

9) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:49    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         });
         $http->on('error', function (Throwable $e) : void {
             if (true === $this->debug) {
-                dump($e);
+                
                 return;
             }
             var_export($e);

10) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:53    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
                 dump($e);
                 return;
             }
-            var_export($e);
+            
         });
         $socket = new SocketServer('0.0.0.0:3000');
         $http->listen($socket);

11) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             var_export($e);
         });
         $socket = new SocketServer('0.0.0.0:3000');
-        $http->listen($socket);
+        
         return 0;
     }
     private function runSync(Application $application) : int

12) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:59    [M] DecrementInteger

--- Original
+++ New
@@ @@
         });
         $socket = new SocketServer('0.0.0.0:3000');
         $http->listen($socket);
-        return 0;
+        return -1;
     }
     private function runSync(Application $application) : int
     {

13) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:59    [M] IncrementInteger

--- Original
+++ New
@@ @@
         });
         $socket = new SocketServer('0.0.0.0:3000');
         $http->listen($socket);
-        return 0;
+        return 1;
     }
     private function runSync(Application $application) : int
     {

15) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:73    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             // UploadedFileFactory
             $psr17Factory
         );
-        $sapi->emit($application->handle($creator->fromGlobals()));
+        
         return 0;
     }
 }

16) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:75    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $psr17Factory
         );
         $sapi->emit($application->handle($creator->fromGlobals()));
-        return 0;
+        return -1;
     }
 }

17) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRunner.php:75    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $psr17Factory
         );
         $sapi->emit($application->handle($creator->fromGlobals()));
-        return 0;
+        return 1;
     }
 }

19) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRuntime.php:23    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->port = $options['port'];
         $this->debug = $options['debug'];
-        parent::__construct($options);
+        
     }
     public function getRunner(?object $application) : RunnerInterface
     {

20) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRuntime.php:28    [M] InstanceOf_

--- Original
+++ New
@@ @@
     }
     public function getRunner(?object $application) : RunnerInterface
     {
-        if ($application instanceof Application) {
+        if (true) {
             return new AntidotRunner($application, $this->debug);
         }
         return parent::getRunner($application);
     }
 }

21) /home/kpicaza/server/antidot-framework-2/packages/antidot-framework/src/Runtime/AntidotRuntime.php:28    [M] InstanceOf_

--- Original
+++ New
@@ @@
     }
     public function getRunner(?object $application) : RunnerInterface
     {
-        if ($application instanceof Application) {
+        if (false) {
             return new AntidotRunner($application, $this->debug);
         }
         return parent::getRunner($application);
     }
 }
